package com.osetrova.project.util;

import lombok.experimental.UtilityClass;

import java.util.ArrayList;
import java.util.List;

@UtilityClass
public class InterestingFactsUtil {

    public static final List<String> FACTS = new ArrayList<>();

    static {
        FACTS.add("Изначально Лару Крофт должны были звать Лаура Круз.");
        FACTS.add("The Sims входила в десятку самых продаваемых игр Великобритании на протяжении двух лет.");
        FACTS.add("Самая первая компьютерная игра была сделана в 1961 году студентом Стивом Расселом. Называлась она Space Wars.");
        FACTS.add("Самой продаваемой игрой за всю историю является Tetris. Всего было продано более 40 млн копий этой игры.");
        FACTS.add("Крупнейшей фирмой-разработчиком компьютерных игр является компания Electronic Arts. Ежегодно эта компания издает игр на сумму более 3 млрд долларов.");
        FACTS.add("Nintendo с японского переводится как \"Оставь удачу небу\".");
        FACTS.add("Лицензионные диски FIFA 2001 были с запахом травы.");
        FACTS.add("Максимальный рекорд, зарегистрированный в игре Pac-Man, составляет 3,333,360 очков.");
        FACTS.add("Средний возраст постоянных покупателей компьютерных игр, по статистике, составляет 40 лет.");
        FACTS.add("Компьютерная игра Halo2 принесла разработчикам в первый день продаж 125 млн долларов - больше, чем любой фильм в истории Голливуда.");
        FACTS.add("Самая дорогостоящая в плане разработки игра называется ShenMue. Она была создана для Sega Dreamcast и обошлась разработчикам в 20 млн долларов.");
        FACTS.add("Самым большим долгостроем в истории компьютерных игр является игра Prey, разработка которой впервые была заявлена в 1995 году, но которая вышла только в июне 2006. За это время Prey сменил несколько концепций и команд разработчиков.");
        FACTS.add("Во многих играх разработчики вставляют невзначай свои имена. Например, в Half Life 2 фамилии разработчиков указаны на шкафчиках в раздевалке, в Fable the Lost Chapters имя директора компании увековечено на могильной плите. И таких игр очень много.");
    }
}
